# Missing Values

In [1]:
import pandas as pd
import numpy as np

In [2]:
Series1 = pd.Series([7,6.8,'Avengers',np.nan,'Apple'])

In [4]:
#isnull() and notnull()

# both the above functions return Boolean ( True or False)

print(Series1.isnull().sum())

print(Series1.notnull().sum())

1
4

In [5]:
###################################

dataset = pd.read_csv('data/train.csv')

print(dataset['Age'].notnull().sum())

print(dataset[dataset['Age'].notnull()].head())

#################################33

#What happens if we try to replace some value with nan?

dataset['Sex'] = dataset['Sex'].replace('female',np.nan)
dataset['Sex']

714
   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S

0      male
1       NaN
2       NaN
3       NaN
4      male
5      male
6      male
7      male
8       NaN
9       NaN
10      NaN
11      NaN
12     male
13     male
14      NaN
15      NaN
16     male
17     male
18      NaN
19      NaN
20     male
21     male
22      NaN
23     male
24      NaN
25      NaN
26     male
27     male
28      NaN
29     male
       ...
861    male
862     NaN
863     NaN
864    male
865     NaN
866     NaN
867    male
868    male
869    male
870    male
871     NaN
872    male
873    male
874     NaN
875     NaN
876    male
877    male
878    male
879     NaN
880     NaN
881    male
882     NaN
883    male
884    male
885     NaN
886    male
887     NaN
888     NaN
889    male
890    male
Name: Sex, Length: 891, dtype: object

## Handling Missing Values by dropping them

In [11]:
import pandas as pd
import numpy as np

df = pd.read_csv('data/Datapreprocessing.csv')
df.head(10)

,Country,Age,Gender,Occupation,Employment Status,Employement Type,Salary,Purchased
0,Poland,34.0,Male,Salaried,Yes,Permanent,72000.0,No
1,Spain,42.0,Female,Business,Yes,Temporary,48000.0,Yes
2,Germany,29.0,Male,Business,No,Temporary,54000.0,No
3,Spain,38.0,Male,Business,No,Permanent,61000.0,No
4,Germany,32.0,Male,Salaried,NaN,Permanent,NaN,Yes
5,Poland,31.0,Female,Business,Yes,Temporary,58000.0,Yes
6,India,NaN,Female,Salaried,NaN,Temporary,52000.0,No
7,Poland,22.0,Female,Salaried,Yes,Self Employed,79000.0,Yes
8,India,38.0,Male,Business,No,NaN,NaN,No
9,Poland,49.0,Male,NaN,Yes,Self Employed,67000.0,Yes

In [6]:
# Get the rows that contains NULL (NaN)
df.isnull().sum()

Country              0
Age                  3
Gender               0
Occupation           2
Employment Status    3
Employement Type     3
Salary               4
Purchased            0
dtype: int64

In [7]:
# data without missing values with respect to columns
data_without_missing_values_cols = df.dropna(axis=1)
data_without_missing_values_cols

    Country  Gender Purchased
0    Poland    Male        No
1     Spain  Female       Yes
2   Germany    Male        No
3     Spain    Male        No
4   Germany    Male       Yes
5    Poland  Female       Yes
6     India  Female        No
7    Poland  Female       Yes
8     India    Male        No
9    Poland    Male       Yes
10   Brazil    Male        No
11    Spain  Female       Yes
12  Germany  Female        No
13    Spain    Male        No
14  Germany    Male       Yes
15   Brazil  Female       Yes
16    Spain  Female       Yes
17  England  Female       Yes
18  Germany    Male        No
19  England    Male       Yes

In [8]:
# data without missing values with respect to rows
data_without_missing_values_rows = df.dropna(axis=0)
data_without_missing_values_rows

,Country,Age,Gender,Occupation,Employment Status,Employement Type,Salary,Purchased
0,Poland,34.0,Male,Salaried,Yes,Permanent,72000.0,No
1,Spain,42.0,Female,Business,Yes,Temporary,48000.0,Yes
2,Germany,29.0,Male,Business,No,Temporary,54000.0,No
3,Spain,38.0,Male,Business,No,Permanent,61000.0,No
5,Poland,31.0,Female,Business,Yes,Temporary,58000.0,Yes
7,Poland,22.0,Female,Salaried,Yes,Self Employed,79000.0,Yes
10,Brazil,34.0,Male,Salaried,No,Permanent,70000.0,No
11,Spain,42.0,Female,Business,No,Temporary,48000.0,Yes
12,Germany,29.0,Female,Business,No,Temporary,54000.0,No
13,Spain,38.0,Male,Business,No,Permanent,61000.0,No
15,Brazil,32.0,Female,Business,Yes,Temporary,58000.0,Yes

In [9]:
#IF we want to get the columns in a dataset with the missing value we will use the following approach
cols_with_missing_values = [col for col in df.columns if df[col].isnull().any()]
cols_with_missing_values

['Age', 'Occupation', 'Employment Status', 'Employement Type', 'Salary']

In [10]:
# drop the columns that contains the missing values then we can follow the below approach
reduced_data = df.drop(cols_with_missing_values, axis=1)
reduced_data

    Country  Gender Purchased
0    Poland    Male        No
1     Spain  Female       Yes
2   Germany    Male        No
3     Spain    Male        No
4   Germany    Male       Yes
5    Poland  Female       Yes
6     India  Female        No
7    Poland  Female       Yes
8     India    Male        No
9    Poland    Male       Yes
10   Brazil    Male        No
11    Spain  Female       Yes
12  Germany  Female        No
13    Spain    Male        No
14  Germany    Male       Yes
15   Brazil  Female       Yes
16    Spain  Female       Yes
17  England  Female       Yes
18  Germany    Male        No
19  England    Male       Yes

## Handling Missing Values Using Imputer

1. First approach will be remove the records that contains the missing values.  
2. Second approach is to use Imputer  
3. Third approach is to use groupby and fill the missing values

In [12]:
# Second Approach using IMPUTER
features = df.iloc[:,:-1].values
print(features)
labels = df.iloc[:,-1].values
print(labels)

[['Poland' 34.0 'Male' 'Salaried' 'Yes' 'Permanent' 72000.0]
 ['Spain' 42.0 'Female' 'Business' 'Yes' 'Temporary' 48000.0]
 ['Germany' 29.0 'Male' 'Business' 'No' 'Temporary' 54000.0]
 ['Spain' 38.0 'Male' 'Business' 'No' 'Permanent' 61000.0]
 ['Germany' 32.0 'Male' 'Salaried' nan 'Permanent' nan]
 ['Poland' 31.0 'Female' 'Business' 'Yes' 'Temporary' 58000.0]
 ['India' nan 'Female' 'Salaried' nan 'Temporary' 52000.0]
 ['Poland' 22.0 'Female' 'Salaried' 'Yes' 'Self Employed' 79000.0]
 ['India' 38.0 'Male' 'Business' 'No' nan nan]
 ['Poland' 49.0 'Male' nan 'Yes' 'Self Employed' 67000.0]
 ['Brazil' 34.0 'Male' 'Salaried' 'No' 'Permanent' 70000.0]
 ['Spain' 42.0 'Female' 'Business' 'No' 'Temporary' 48000.0]
 ['Germany' 29.0 'Female' 'Business' 'No' 'Temporary' 54000.0]
 ['Spain' 38.0 'Male' 'Business' 'No' 'Permanent' 61000.0]
 ['Germany' nan 'Male' 'Salaried' 'Yes' 'Permanent' nan]
 ['Brazil' 32.0 'Female' 'Business' 'Yes' 'Temporary' 58000.0]
 ['Spain' nan 'Female' 'Salaried' 'Yes' 'Temporary' 52000.0]
 ['England' 22.0 'Female' 'Salaried' 'Yes' nan 85000.0]
 ['Germany' 38.0 'Male' 'Business' 'Yes' nan nan]
 ['England' 45.0 'Male' nan nan 'Self Employed' 67000.0]]
['No' 'Yes' 'No' 'No' 'Yes' 'Yes' 'No' 'Yes' 'No' 'Yes' 'No' 'Yes' 'No'
 'No' 'Yes' 'Yes' 'Yes' 'Yes' 'No' 'Yes']

In [14]:
from sklearn.preprocessing import Imputer

imputer = Imputer(missing_values='NaN',strategy='mean',axis=0)
print(imputer)

# 2 step transformation 
# Fit and Tranform

imputer.fit(features[:,[1,6]])

features[:,[1,6]] = imputer.fit_transform(features[:,[1,6]])

df1 = pd.DataFrame(features)
print(df1)

Imputer(axis=0, copy=True, missing_values='NaN', strategy='mean', verbose=0)
          0   1       2         3    4              5      6
0    Poland  34    Male  Salaried  Yes      Permanent  72000
1     Spain  42  Female  Business  Yes      Temporary  48000
2   Germany  29    Male  Business   No      Temporary  54000
3     Spain  38    Male  Business   No      Permanent  61000
4   Germany  32    Male  Salaried  NaN      Permanent  61625
5    Poland  31  Female  Business  Yes      Temporary  58000
6     India  35  Female  Salaried  NaN      Temporary  52000
7    Poland  22  Female  Salaried  Yes  Self Employed  79000
8     India  38    Male  Business   No            NaN  61625
9    Poland  49    Male       NaN  Yes  Self Employed  67000
10   Brazil  34    Male  Salaried   No      Permanent  70000
11    Spain  42  Female  Business   No      Temporary  48000
12  Germany  29  Female  Business   No      Temporary  54000
13    Spain  38    Male  Business   No      Permanent  61000
14  Germany  35    Male  Salaried  Yes      Permanent  61625
15   Brazil  32  Female  Business  Yes      Temporary  58000
16    Spain  35  Female  Salaried  Yes      Temporary  52000
17  England  22  Female  Salaried  Yes            NaN  85000
18  Germany  38    Male  Business  Yes            NaN  61625
19  England  45    Male       NaN  NaN  Self Employed  67000

In [ ]:
#Fill the missing values for non-numeric columns
cols = ['Occupation','Employment Status','Employement Type']

df[cols] = df[cols].fillna(df.mode().iloc[0])

# Detecting and handling Outliers

In [15]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [16]:
Topic to be covered - Detect Outlier using the Mathematical Formula  
  
Step 1 - Sort the Pandas Column
  
Step 2 - Calculate Lower Quartile, Upper Quartile and Inter Quartile 
  
Q1 = Lower Quartile
  
Q3 = Upper Quartile
  
IQR = Inter Quartile Range
  
lower Boundary =  Q1 - 1.5 * IQR
  
Upper Boundary = Q3 + 1.5 * IQR
"""

In [22]:
import pandas as pd
import numpy as np

df = pd.DataFrame()

df['count'] = [5,8,6,2,9,11,15,16,25,40,23]

df.sort_values(by='count',inplace=True)
print(df)

    count
3       2
0       5
2       6
1       8
4       9
5      11
6      15
7      16
10     23
8      25
9      40

In [21]:
print(df.describe())

           count
count  11.000000
mean   14.545455
std    11.129813
min     2.000000
25%     7.000000
50%    11.000000
75%    19.500000
max    40.000000

In [23]:
Q1, Q2, Q3 = np.percentile(df,[25,50,75])

IQR = Q3 - Q1

lower_boundary = Q1 - 1.5 * IQR 
print(lower_boundary)

upper_boundary = Q3 + 1.5 * IQR
print(upper_boundary)

-11.75
38.25

<span style="color:red; font-family:Comic Sans MS"> **above Code pulled from:** </span>  
<a href="https://github.com/technologycult/PythonForMachineLearning" target="_blank">https://github.com/technologycult/PythonForMachineLearning</a>